{
  "main": {
    "name":"Adam Courchesne",
    "description":"Welcome! I developed this website using an open source template I found on GitHub to learn about web application development in ReactJS. Now, I use this website as the definitive archive of all of my relevant work experiences, education, and projects.",
    "headerimage":"headerimage4.jpg",
    "image":"headshot.jpg",
    "bio":"Budding software developer, student, and Lego collector. My current goals are to explore my options in the realm of biomedical engineering to establish what I'm really passionate about. My current professional interests include sports engineering, entrepreneurship and exercise science. You might have noticed this is the same bio I use on my Linkedin. If you've taken the time to look at both my Linkedin and my website, you should really consider reaching out to me.",
    "email": "courchesneadam@gmail.com",
    "alternativeemail": "acourche@uwaterloo.ca",
    "phone": "(705) 358-1785",
    "address":{
      "street":"1098 Premier Road",
      "city":"North Bay",
      "state":"Ontario",
      "zip": "P1A 2J1"
    },
    "website": "website-logo.ico",
    "resumedownload":"adam-courchesne-resume-feb-2022.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/adamcourchesne",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/adamcourchesne/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/adamcourchesne",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "uwimage":"uwaterloo.png",
    "maimage":"metricaid.png",
    "education":[
      {
        "school":"University of Waterloo",
        "degree":"Candidate for BASc in Biomedical Engineering",
        "graduated":"Sept. 2019 - Apr. 2024",
        "description":"I decided to come to the University of Waterloo for their co-op program. I love the idea of gaining hands-on experience closely related to the skills I'm developing in school. So far, I've learnt about the engineering design process, computer aided design, object oriented programming, numeric computing in MATLAB, circuit design and instrumentation, embedded systems design, and prototyping using Arduinos.",
        "courseheader":"These are some courses I found interesting: ",
        "courses": ["BME 122: Data Structures and Algorithms", "STV 205: Cybernetics and Society", "BME 294: Circuits, Instrumentation, and Measurements","BME 261: Prototyping, Simulation and Design","BME 393: Digital Systems"]
      }
    ],
    "work":[
      {
        "company":"MetricAid",
        "title":"Software Developer/Digital Marketing Intern",
        "years":"May 2020 - December 2021",
        "description":"I spent my first three co-op terms at MetricAid. During my first term, I learnt the ropes in web application development using CSS, JS, HTML, Golang, and PostgreSQL. During my three coops I completed several major feature-adds and countless tricky bug fixes. My proudest new feature was a rating system that let users give feedback on the service the company provided. This project consisted of a reporting screen that displayed all of the collected ratings, equipped with sorting and filtering functionality to boot. This feature became the third most used tool in the entire web application only a few months after it's release! During my third term, I also picked up the responsibility of managing the company newsletter. After the third newsletter I published, our audience had grown from 5726 to 8028 recipients.",
        "website":"https://www.metricaid.com/news"
      },
      {
        "company":"Roots Canada",
        "title":"Sales Associate",
        "years":"April 2015 - September 2019",
        "description":"If I had a dollar for every sweater I folded working at Roots, I wouldn't have needed a job in the first place. But in all seriousness, I developed a lot of experience managing inventory and selling products over my 4 year tenure with the company. I also got to practice my French language skills while working with French speaking customers."
      },
      {
        "company":"Duke of Edinburgh",
        "title":"Volunteer",
        "years":"April 2015 - September 2019",
        "description":"I completed over 250 volunteer hours with the Duke of Edinburgh program and spent a month over two separate humanitarian trips renovating classrooms and community centers in a Costa Rican township and the surrounding area. By the end of my time with the program, I had received multiple Ontario Volunteer Service awards, and the Matt Peters Volunteer Service Award for demonstrating strong leadership qualities."
      }
    ]
  },
  "testimonials":{
  "testimonials":[
      {
        "user":"Jeff Francom - MetricAid Chief Software Architect",
        "text":"He strives for better implementations whenever possible and is not afraid to critique his prior work in order to gain a valuable learning experience."
      },
      {
        "user":"Brad Simard - MetricAid Development Manager",
        "text":"Adam demonstrates outstanding interpersonal skills that make it a treat to work with him."
      },
      {
        "user":"Lora Webb - MetricAid CEO",
        "text":"I could not manage our quarterly newsletters without Adam; his diligence, writing skills, attention to detail and good nature make him an incredibly valuable team member.  Adam continues to look for ways to improve our processes and the quality of deliverables and actively leads the development of our newsletter."
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"MotorNeuron",
        "category":"Biomedical Design Project",
        "image":"motorneuron.jpg",
        "carouselImages":["motorneuron.jpg"],
        "carouselCaptions":["Motorneuron MVP"],
        "description":"In a prototyping and design course I took as part of my biomedical engineering undergraduate degree, I worked with a small team to produce a novel solution to peripheral neuropathy. Peripheral neuropathy is a condition in which damage to the peripheral nervous system causes numbness and pain in the lower limbs and hands. Our solution to this problem was a system in which a pressure sensitive sheet was connected to a foam shoe sole, and vibrating DC motors would generate a stimulus at the thigh corresponding to pressures applied at the foot. By the end of this project, I had learnt valuable lessons about time management, technical report writing, the engineering design process, writing code with the Arduino IDE, collaboration, circuit design, and interdisciplinary work by applying an engineering solution to a physiological problem space.",
        "type":"Academic",
        "skills":["Engineering Design", "Collaboration", "Technical Writing", "Project Management"]
        
      },
      {
        "title":"MetricAid Rating Tool",
        "category":"Proud Feature Add",
        "image":"ratings.jpg",
        "carouselImages":["ratings.jpg"],
        "carouselCaptions":["The reporting page used to view submitted ratings"],
        "description":"This is the ratings tool I had talked about in the resume section of my website. Depending on where you navigate to the report from, the filter on the right will already be populated with the relevant contextual information. Clicking on the column headers will sort the report based on the contents of that column.",
        "skills":["Web App Development", "Frontend Development (JS, CSS, HTML)", "Database Management (PostgreSQL)", "Backend Development (Golang)"],
        "type":"Professional",
        "link":"https://www.metricaid.com/news/rate-my-schedule"
      },
      {
        "title":"This Website",
        "category":"Personal Development Project",
        "image":"website.jpg",
        "carouselImages":["website.jpg"],
        "carouselCaptions":["The landing page of the website (but you already knew that)"],
        "description":"I developed this website as a way to learn ReactJS. I found an open source template online and modified it to serve my purposes. I wanted to take on a new project during one of my co-op terms, but needed to have a foundational understanding of ReactJS to do the job right. Building this website gave me exactly that.",
        "type":"Personal",
        "skills":["Web App Development", "Frontend Development (ReactJS, CSS)", "UI design"]
      },
      {
        "title":"Computer Desk",
        "category":"Personal Woodworking Project",
        "image":"desk.jpg",
        "carouselImages":["desk.jpg", "desk-blueprint.jpg", "desk-blueprint-trial.jpg"],
        "carouselCaptions":["Finished desk", "3D model of the finished desk made in Onshape", "3D model of one of my first designs. I didn't end up following through with this because the custom metal frame would be too expensive"],
        "description":"I wanted an L-shaped desk for my room, but the size I needed wasn't easy to find online. So, I decided to make my own. I designed the desk using Onshape, then bought enough maple to build the desktop and got the three legs already made through my lumber supplier. After prepping the maple using a planar and a hand saw as a jointer, I laminated the boards together with wood glue and biscuits. I then went around the base of the desktop using a 45 degree chamfer bit on my router. Finally, I finished the desktop with about 6 coats of Varathane and attached the legs.",
        "type":"Personal",
        "skills":["Computer-Aided Design (CAD)", "Preparing Rough Lumber", "Resourcefullness", "Power Tools"]
        
      },
      {
        "title":"Playground",
        "category":"Volunteer Work",
        "image":"playground.jpg",
        "carouselImages":["playground.jpg"],
        "carouselCaptions":["Finished playground"],
        "description":"One of the projects I worked on while on a humanitarian trip in Costa Rica was this playground. The grass in the image used to be dirt, and inside that dirt were large tires filled with concrete to keep them in the ground. Once those were dug out, sod was placed along the ground and the playset was built around it. The outcome of this project was a safe space for the elementary school children to play on.",
        "type":"Volunteer",
        "skills":["Collaboration", "Landscaping", "Hand Tools", "Power Tools", "Leadership"]
      }
    ]
  }
}
